{
  "main": {
    "name":"Nathan Phennel",
    "occupation":"Dev | Test Engineer",
    "description":"Developer | Tester | Music Maker",
    "image":"profilepic.png",
    "bio":"To pun it lightly, I'm a jack of all trades and a master of test. I have 4 years experience as a Web Developer and 3 years as a Test Engineer. I specialize in front-end work but can comfortably leverage the power of Node.js, React, Google Cloud Platform and CI/CD setup. I'm looking for a web developer position at a company which will utilize my excellent team management and communication skills.",
    "bio2":"In my free time, when not looking at code, I'm making music.",
    "contactmessage":"Use this handy lil form and I'll receive your message.",
    "email": "nathanphennel@gmail.com",
    "address":{
      "city":"Sydney",
      "state":"NSW",
      "zip": "2000"
    },
    "website": "http://enphnt.github.io",
    "resumedownload":"/NathanPhennelProfile.pdf",
    "social":[
      {
        "name":"github",
        "url":"http://github.com/enphnt",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://au.linkedin.com/in/enphnt",
        "className":"fa fa-linkedin"
      },
      {
        "name":"gitlab",
        "url":"http://gitlab.com/enphnt",
        "className":"fa fa-code-fork"
      }
    ]
  },
  "resume":{
    "skillmessage":"In software, I have a skill-set developed from both professional and personal ventures.",
    "work":[
      {
        "company":"Temenos (Avoka)",
        "title":"Software Developer / Test Engineer",
        "years":"January 2018 - Present",
        "description":"Developed an analytics product used internationally by Bank staff which leverages behavioral data to aid decision making. We use continuous testing (CI) to protect against regressions. I also work the product development which is a TS, React, Redux, Java stack hosted on GCP. For the wider company, I developed a unified framework for writing unit/integration/e2e tests to better align testers and devs."
      },
      {
        "company":"Domain Group",
        "title":"Test Engineer",
        "years":"October 2016 - December 2017",
        "description":"Web and API test automation running in CI to ensure our public site was always working as expected for our millions of users. To improve performance and security, I used Node.js and frameworks such as Nightwatch, Cypress, Puppet, Protractor and Web service tools like Postman/Newman, Rest-Assured, JMeter, Gatling. I integrated tests/bots into CI pipeline tools Jenkins, CircleCI, GitHub to build continuous testing tools."
      },
      {
        "company":"Quantium",
        "title":"Test Engineer",
        "years":"January 2014 - October 2016",
        "description":"I oversaw the design, execution and maintenance of manual and automated tests for analytics product to support Woolworth's suppliers. Used Protractor, C#, and F# frameworks combined with local builds from feature branches to test breaking changes. I provided a robust communication channel between developers and QA which were dispersed globally."
      }
    ],
    "education":[
      {
        "school":"University of Technology, Sydney",
        "degree":"Master of Information Technology",
        "graduated":"April 2014",
        "link": "https://www.sciencedirect.com/science/article/pii/S0306437915302192",
        "description": "Maintained a High Distinction Average throughout my degree. Focus included software development, design, implementation and maintenance. As part of my final research around IoT use in emergencies, my work was published in a scholarly journal: "
      },
      {
        "school":"University of North Texas",
        "degree":"Bachelor of Arts, International Studies",
        "graduated":"December 2009",
        "link": "https://www.ntdaily.com/students-to-teach-in-korea/",
        "description":"I minored in Spanish. In the end, I graduated Cum Laude and maintained the Dean's list. Study programs abroad included Summer Semester in Mexico for Spanish immersion and Winter Semester in India for Ethnomusicology. To finish, I spearheaded a program to send teachers to Korea. There was even an article about my mission: "
      }
    ],
    "skills":[
      {
        "name":"js",
        "level":"90%"
      },
      {
        "name":"React",
        "level":"80%"
      },
      {
        "name":"redux",
        "level":"70%"
      },
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"Docker",
        "level":"50%"
      },
      {
        "name":"Java",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Banterer",
        "category":"Displays comical and smart quotes in the terminal for dev inspiration.",
        "image":"banterer.png",
        "url":"https://www.npmjs.com/package/banterer"
      },
      {
        "title":"nighthelper",
        "category":"A tool for quickly generating tests, page objects, configuration files and custom commands.",
        "image":"nighthelper.jpg",
        "url": "https://www.npmjs.com/package/nighthelper"
      },
      {
        "title":"Chat Application",
        "category":"A basic chat app built with React, Redux, Redux-Saga, and web sockets.",
        "image":"chat-app.jpg",
        "url":"https://github.com/enphnt/chat/"
      },
      {
        "title":"Wedding Gallery",
        "category":"Static site to share photos of our special day.",
        "image":"wedding-photo-gallery.jpg",
        "url":"https://enphnt.github.io/hanna-nathan-gallery/"
      },
      {
        "title":"This Very Website!",
        "category":"🙌  I dare you to audit this site to really appreciate the site performance.",
        "image":"resume-website.jpg",
        "url":"https://github.com/enphnt/enphnt.github.io/tree/develop"
      },
      {
        "title":"TotM",
        "category":"Family-Feud-style guessing game with Google search autocomplete.",
        "image":"totm.jpg",
        "url":"http://www.playtotm.com/"
      },
      {
        "title":"uTest Community",
        "category":"I've tested everything from shopping cart systems to 'smart' digital set top boxes for TV.",
        "image":"utest.jpg",
        "url":"https://www.utest.com/profile/p151929/about"
      },
      {
        "title":"IoT in Emergency",
        "category":"IoT device to warn users of impending natural disasters.",
        "image":"iot-emergency-research.jpg",
        "url": "https://www.sciencedirect.com/science/article/pii/S0306437915302192"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"He operates with a long-term strategic view and a day-to-day sense of urgency. Not someone who sits back on his heels and waits for things to happen ... he sees the need and makes it happen now.",
        "user":"Ken M. - Technical Writer @Temenos"
      },
      {
        "text":"I definitely recommend Nathan as he is a great agile tester with a strong appetite to learn. He is broad-minded and thinks outside of the box.",
        "user":"Raja Bellebon - SDET @Atlassian"
      },
      {
        "text":"A high-achiever who is capable of digesting any new advanced technical knowledge you present at him. A studious individual who will go the extra miles/hours.",
        "user":"Henry Santoso - Consultant @Servian"
      },
      {
        "text":"Nathan always aims to work towards achieving growth for the entire team, accomplishing goals, devising plans to achieve best results.",
        "user":"Jaya Ramesh - Senior Programmer @Avoka"
      }
    ]
  }
}
