{
  "main": {
    "name":"Nathan Phennel",
    "occupation":"Test Engineer",
    "description":"As a hybrid of tester/developer, I work closely with devs to design, perform, and automate testing",
    "image":"profilepic.jpg",
    "bio":"I write mainly JavaScript code for end to end and integration tests. However, to make continuous testing a reality, I leverage js to create needed tooling and infrastructure. To pun it lightly, I'm a jack of all trades and a master of test. In addition to performing and writing tests, I help to create procedures that give teams transparent actionable feedback to expose risk early and build confidence with every build.",
    "bio2":"In my free time, when I'm not looking at code, I'm making music on drumset, bass, guitar or the computer. I also enjoy playing with video and video editing to put together funny things here and there.",
    "contactmessage":"TODO: fix this comment form; Til then, email me if you want to get in touch about a software testing opportunity.",
    "email": "nathanphennel@gmail.com",
    "address":{
      "city":"Sydney",
      "state":"NSW",
      "zip": "2000"
    },
    "website": "http://www.enphnt.github.io",
    "resumedownload":"/NathanPhennelProfile.pdf",
    "social":[
      {
        "name":"github",
        "url":"http://github.com/enphnt",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://au.linkedin.com/in/enphnt",
        "className":"fa fa-linkedin"
      }
    ]
  },
  "resume":{
    "skillmessage":"In software, I have a skill-set developed from both professional and personal ventures.",
    "work":[
      {
        "company":"Avoka",
        "title":"Software Test Engineer",
        "years":"January 2018 - Present",
        "description":"My focus is testing required the analytics product and leveraging behavioral data to influence decisions. Hybrid of a software tester and a developer to automate testing and maintain continuous testing. We are currently aiming to create a unified framework for writing unit/integration/e2e tests to better align testers and devs."
      },
      {
        "company":"Domain Group",
        "title":"Software Test Engineer",
        "years":"October 2016 - December 2017",
        "description":"I looked after new Web and API test automation as well as maintenance of those test running in CI, often debugging and improving tests. Used Node.js E2E frameworks such as Nightwatch, Cypress, Protractor. As well we used tools Web service test tools such as Postman/Newman, Rest- Assured, JMeter, Gatling. Integrated tests/bots into CI pipeline tools Jenkins, CircleCI, GitHub."
      },
      {
        "company":"Quantium",
        "title":"Software Test Engineer",
        "years":"January 2014 - October 2016",
        "description":"Looked over design, execution and maintenance of manual and automated tests. Used Protractor combined with local builds from feature branches to test breaking changes. Overall, I provided a robust communication channel between developers and QA."
      }
    ],
    "education":[
      {
        "school":"University of Technology, Sydney",
        "degree":"Master of Information Technology",
        "graduated":"April 2014",
        "link": "https://www.sciencedirect.com/science/article/pii/S0306437915302192",
        "description": "Maintained a High Distinction Average throughout my degree. Focus included software development, design, implementation and maintenance. As part of my final research, my work was published in a scholarly journal: "
      },
      {
        "school":"University of North Texas",
        "degree":"Bachelor of Arts, International Studies",
        "graduated":"December 2009",
        "description":"I minored in Spanish. In the end, I graduated Cum Laude and maintained the Dean's list. Study programs abroad included Summer Semester in Mexico for Spanish immersion and Winter Semester in India for Ethnomusicology."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"mochajs",
        "level":"80%"
      },
      {
        "name":"js",
        "level":"70%"
      },
      {
        "name":"Docker",
        "level":"50%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"Python",
        "level":"50%"
      },
      {
        "name":"C#",
        "level":"40%"
      },
      {
        "name":"Java",
        "level":"30%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Resume Website",
        "category":"This very site! 🙌 Made using a React based resume website template.",
        "image":"resume-website.jpg",
        "url":"http://www.enphnt.github.io"
      },
      {
        "title":"Tyranny of the Majority (TotM)",
        "category":"Game built with a friend that combines Family-Feud-style guessing with Google search autocompletes.",
        "image":"totm.jpg",
        "url":"http://www.playtotm.com/"
      },
      {
        "title":"uTest Community",
        "category":"I've tested everything from shopping cart systems to 'smart' digital set top boxes for TV.",
        "image":"utest.jpg",
        "url":"https://www.utest.com/profile/p151929/about"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I definitely recommend Nathan as he is great Agile Tester with always a strong appetite to learn. He is broad minded and thinks outside of the box most of the time. He is mastering few automation languages.Hence, a great asset for any BA/QA/Testers team.",
        "user":"Raja Bellebon - SDET @Atlassian"
      },
      {
        "text":"A high-achiever who is capable of digesting any new advanced technical knowledge you present at him. A studious individual who will take the extra miles/ hours.",
        "user":"Henry Santoso - Consultant @Servian"
      }
    ]
  }
}
