{
  "main": {
    "name":"Nathan Phennel",
    "occupation":"Test Engineer",
    "description":"Hybrid software tester/developer striving to better automate testing",
    "image":"profilepic.jpg",
    "bio":"I started my journey in end-to-end (e2e) and integration testing. However, to make continuous testing a reality, I develop code for tooling and infrastructure. To pun it lightly, I'm a jack of all trades and a master of test. In addition to performing and writing tests, I strive to give transparent actionable feedback to expose risk early and build confidence with every build.",
    "bio2":"In my free time, when not looking at code, I'm making music on drum set, bass, guitar or whatever music toys I can get my hands on. I also enjoy playing with video and video editing to put together funny things here and there.",
    "contactmessage":"Use this handy lil form and I'll receive your message.",
    "email": "nathanphennel@gmail.com",
    "address":{
      "city":"Sydney",
      "state":"NSW",
      "zip": "2000"
    },
    "website": "http://enphnt.github.io",
    "resumedownload":"/NathanPhennelProfile.pdf",
    "social":[
      {
        "name":"github",
        "url":"http://github.com/enphnt",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://au.linkedin.com/in/enphnt",
        "className":"fa fa-linkedin"
      },
      {
        "name":"gitlab",
        "url":"http://gitlab.com/enphnt",
        "className":"fa fa-code-fork"
      }
    ]
  },
  "resume":{
    "skillmessage":"In software, I have a skill-set developed from both professional and personal ventures.",
    "work":[
      {
        "company":"Avoka",
        "title":"Software Test Engineer",
        "years":"January 2018 - Present",
        "description":"My primary focus is looking over the testing required for the analytics product which leverage behavioral data to aid decision making. We use continuous testing (CI) to protect against regressions. I also work on dev work for the product involving redux and react as well as a unified framework for writing unit/integration/e2e tests to better align testers and devs."
      },
      {
        "company":"Domain Group",
        "title":"Software Test Engineer",
        "years":"October 2016 - December 2017",
        "description":"I looked after new Web and API test automation as well as maintenance of those test running in CI, debugging and improving tests along the way. Working to help with performance and security needs, I used Node.js and frameworks such as Nightwatch, Cypress, Puppet, Protractor and Web service tools like Postman/Newman, Rest- Assured, JMeter, Gatling. I integrated tests/bots into CI pipeline tools Jenkins, CircleCI, GitHub to build continuous testing tools."
      },
      {
        "company":"Quantium",
        "title":"Software Test Engineer",
        "years":"January 2014 - October 2016",
        "description":"I oversaw the design, execution and maintenance of manual and automated tests for another analytics product. Used Protractor, C#, and F# frameworks combined with local builds from feature branches to test breaking changes. Overall, I provided a robust communication channel between developers and QA."
      }
    ],
    "education":[
      {
        "school":"University of Technology, Sydney",
        "degree":"Master of Information Technology",
        "graduated":"April 2014",
        "link": "https://www.sciencedirect.com/science/article/pii/S0306437915302192",
        "description": "Maintained a High Distinction Average throughout my degree. Focus included software development, design, implementation and maintenance. As part of my final research around IoT use in emergencies, my work was published in a scholarly journal: "
      },
      {
        "school":"University of North Texas",
        "degree":"Bachelor of Arts, International Studies",
        "graduated":"December 2009",
        "link": "https://www.ntdaily.com/students-to-teach-in-korea/",
        "description":"I minored in Spanish. In the end, I graduated Cum Laude and maintained the Dean's list. Study programs abroad included Summer Semester in Mexico for Spanish immersion and Winter Semester in India for Ethnomusicology. To finish, I spearheaded a program to send teachers to Korea. There was even an article about my mission: "
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"mochajs",
        "level":"80%"
      },
      {
        "name":"js",
        "level":"70%"
      },
      {
        "name":"ReactJs",
        "level":"60%"
      },
      {
        "name":"redux",
        "level":"50%"
      },
      {
        "name":"Docker",
        "level":"50%"
      },
      {
        "name":"Python",
        "level":"50%"
      },
      {
        "name":"C#",
        "level":"40%"
      },
      {
        "name":"Java",
        "level":"30%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Chat Application",
        "category":"A basic chat app built with React, Redux, Redux-Saga, and web sockets.",
        "image":"chat-app.jpg",
        "url":"https://github.com/enphnt/chat/tree/develop"
      },
      {
        "title":"Wedding Photo Gallery",
        "category":"Instead of speading via fb, made a static site using github-pages site w/React. The pictures are great but still don't capture the awesomeness.",
        "image":"wedding-photo-gallery.jpg",
        "url":"https://github.com/enphnt/enphnt.github.io/tree/develop"
      },
      {
        "title":"This Very Website!",
        "category":"🙌  I made this custom github-pages site using React with JSON for data storage. Audit this site to really appreciate the performance.",
        "image":"resume-website.jpg",
        "url":"https://github.com/enphnt/enphnt.github.io/tree/develop"
      },
      {
        "title":"Tyranny of the Majority (TotM)",
        "category":"Game built with a friend that combines Family-Feud-style guessing with Google search autocompletes.",
        "image":"totm.jpg",
        "url":"http://www.playtotm.com/"
      },
      {
        "title":"uTest Community",
        "category":"I've tested everything from shopping cart systems to 'smart' digital set top boxes for TV.",
        "image":"utest.jpg",
        "url":"https://www.utest.com/profile/p151929/about"
      },
      {
        "title":"nighthelper",
        "category":"Because I was using nightwatch extensively, I made a generic tool for quickly generating tests, page objects, configuration files and custom commands.",
        "image":"nighthelper.jpg",
        "url": "https://www.npmjs.com/package/nighthelper"
      },
      {
        "title":"IoT in Emergency Research",
        "category":"As part of my Master of IT, I developed a device using a Raspberry Pi and some custom python code to warn users of impending natural disasters.",
        "image":"iot-emergency-research.jpg",
        "url": "https://www.sciencedirect.com/science/article/pii/S0306437915302192"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I definitely recommend Nathan as he is a great agile tester with a strong appetite to learn. He is broad-minded and thinks outside of the box. He is mastering automation languages. Hence, a great asset for any BA/QA/Testers team.",
        "user":"Raja Bellebon - SDET @Atlassian"
      },
      {
        "text":"A high-achiever who is capable of digesting any new advanced technical knowledge you present at him. A studious individual who will go the extra miles/hours.",
        "user":"Henry Santoso - Consultant @Servian"
      }
    ]
  }
}
